Catalogs/Организации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Организации</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипОрганизации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьРуководителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГлавныйБухгалтер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ТипыОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыОрганизаций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮридическоеЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИндивидуальныйПредприниматель</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Организации/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	
	 Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ИНН) Тогда
        Отказ = Истина;
        Сообщить("Заполните ИНН", СтатусСообщения.Важное);
        Возврат;
    КонецЕсли;
    
    ТипОрганизации = ЭтотОбъект.ТипОрганизации;     

	ДлинаИНН = СтрДлина(СокрЛП(ЭтотОбъект.ИНН));
    
    Если ТипОрганизации = ПредопределенноеЗначение("Перечисление.ТипыОрганизаций.ИндивидуальныйПредприниматель") Тогда
        Если ДлинаИНН <> 12 Тогда
            Отказ = Истина;
            Сообщить("Для ИП ИНН должен содержать 12 символов. Введено " + ДлинаИНН + ".", СтатусСообщения.Важное);
        КонецЕсли;
    ИначеЕсли ТипОрганизации = ПредопределенноеЗначение("Перечисление.ТипыОрганизаций.ЮридическоеЛицо") Тогда
        Если ДлинаИНН <> 10 Тогда
            Отказ = Истина;
            Сообщить("Для юридического лица ИНН должен содержать 10 символов. Введено " + ДлинаИНН + ".", СтатусСообщения.Важное);
		КонецЕсли;
	ИначеЕсли ДлинаИНН <> 10 или ДлинаИНН <> 12 тогда
		Отказ = Истина;
            Сообщить("Длина ИНН некорректна", СтатусСообщения.Важное);
	КонецЕсли;
		
	Если ЭтотОбъект.ТипОрганизации <> ПредопределенноеЗначение("Перечисление.ТипыОрганизаций.ЮридическоеЛицо") И 
		ЗначениеЗаполнено(ЭтотОбъект.ГлавныйБухгалтер) тогда
			ЭтотОбъект.ГлавныйБухгалтер = Справочники.Организации.ПустаяСсылка();
	КонецЕсли;		

КонецПроцедуры
